FC_Permissions_sand_get_2022/FC_Baseline_Tests.yml
execution:
#- executor: jmeter
- concurrency: 250
  ramp-up: 250s
  hold-for: 55m
  scenario: SC01_Get_Actions_Permissions
 - concurrency: 75
  ramp-up: 75s
  hold-for: 55m
  scenario: SC02_Get_NumVisibleContextids_6

scenarios:
  SC01_Get_Actions_Permissions:
    script: SC01_Get_Actions_Permissions.jmx
  SC02_Get_NumVisibleContextids_6:
    script: SC02_Get_NumVisibleContextids_6.jmx

modules:
  console:
    disable: true # disable runtime console reporter

reporting:
#- module: console
- module: passfail
  criteria:
  - avg-rt>10s for 30s, stop as failed
  - fail>50% for 20s, stop as failed